## Plan Result (Dev - TerraformPlanApply)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.dev-apps-public-dns.azurerm_dns_cname_record.this[&#34;darts&#34;]
  * module.dev-apps-public-dns.azurerm_dns_cname_record.this[&#34;glimr&#34;]
  * module.dev-apps-public-dns.azurerm_dns_zone.zone
  * module.dev-apps-public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.dev-apps-public-dns.azurerm_dns_cname_record.this["darts"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "darts"
      + record              = "sdshmcts-dev-c4ercybwaubzbmfn.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "dev.apps.hmcts.net"
    }

  # module.dev-apps-public-dns.azurerm_dns_cname_record.this["glimr"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "glimr"
      + record              = "hmcts-nle-int-cfgpbgagf9eedcar.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "dev.apps.hmcts.net"
    }

  # module.dev-apps-public-dns.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "dev.apps.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record (known after apply)
    }

  # module.dev-apps-public-dns.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a02b18e4-fba7-4d7d-9603-07e128f4126a"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1885,"Program":"tfcmt","SHA1":"","Target":"Dev - TerraformPlanApply","Vars":{}} -->